Configuration/InformationRegisters/СоответствиеВидовРаспознаваемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеВидовРаспознаваемыхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипФормализованногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФормализованныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/СоответствиеВидовРаспознаваемыхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Записать данные.
// 
// Параметры:
//  СоответствиеВидовДокументов - ТаблицаЗначений
Процедура ЗаписатьДанные(СоответствиеВидовДокументов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Набор = СоздатьНаборЗаписей();
	Набор.Загрузить(СоответствиеВидовДокументов);
	Набор.Записать(Истина);
	
КонецПроцедуры	

// Вид формализованного документа.
// 
// Параметры:
//  ТипФормализованногоДокумента - ПеречислениеСсылка.ТипыФормализованныхДокументов
// 
// Возвращаемое значение:
//  Неопределено, Структура - Вид формализованного документа:
// * ВидДокумента - СправочникСсылка.ВидыДокументов - 
// * Тематика - СправочникСсылка.ТематикиДокументов - 
Функция ВидФормализованногоДокумента(ТипФормализованногоДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СоответствиеВидовРаспознаваемыхДокументов.ВидДокумента,
		|	СоответствиеВидовРаспознаваемыхДокументов.Тематика
		|ИЗ
		|	РегистрСведений.СоответствиеВидовРаспознаваемыхДокументов КАК СоответствиеВидовРаспознаваемыхДокументов
		|ГДЕ
		|	СоответствиеВидовРаспознаваемыхДокументов.ТипФормализованногоДокумента = &ТипДокумента");

	Запрос.УстановитьПараметр("ТипДокумента", ТипФормализованногоДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ВидДокумента, Тематика", Выборка.ВидДокумента, Выборка.Тематика);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Соответствие видов распознаваемых документов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Соответствие видов распознаваемых документов
Функция СоответствиеВидовРаспознаваемыхДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СоответствиеВидовРаспознаваемыхДокументов.ТипФормализованногоДокумента,
		|	СоответствиеВидовРаспознаваемыхДокументов.ВидДокумента,
		|	СоответствиеВидовРаспознаваемыхДокументов.Тематика
		|ИЗ
		|	РегистрСведений.СоответствиеВидовРаспознаваемыхДокументов КАК СоответствиеВидовРаспознаваемыхДокументов
		|");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
